app/Businesses/AuthManager.php

    public function login(LoginRequest $loginRequest)
    {

        $is_email = $this->usersModel->where('email', $loginRequest->getEmail())->first();
---
SELECT *
FROM `users`
WHERE `email` = 'oguzhan.parlak@yahoo.com'
 LIMIT 1