app/Businesses/RecipeManager.php

    public function add(RecipeAddRequest $recipeAddRequest){

        $data = [
            "recipe_title" => $recipeAddRequest->getRecipeTitle(),
            "recipe_description" => $recipeAddRequest->getRecipeDescription(),
        ];

        return $this->recipesModel->insert($data);
---
INSERT INTO `recipes` (`recipe_title`, `recipe_description`) VALUES ('Sarma Dolma', '30 derecelik fırında')