app/Businesses/UserManager.php

INSERT INTO `users` (`email`, `password`) VALUES ('asd2asmd@ad2323aadi.clom', '$2y$10$hVcArDCvHpJ1v1tSz6Ord.Dp3wtg9O1pW2Oy97WaUw/KtLjDrlsFu')
---
    public function add(UserAddRequest $userAddRequest){

        $data = [
            "email" => $userAddRequest->getEmail(),
            "password" => $userAddRequest->getPassword(),
        ];

         // UsersModel içinde tanımlanan validationRules kullanılacak
        if (!$this->usersModel->validate($data)) {
            // Validasyon başarısız olursa, hata mesajlarını al
            $errors = $this->usersModel->errors();

            // Hata mesajlarını içeren bir exception fırlat
            throw new Exception(json_encode($errors));
        }

        $data['password'] = password_hash($userAddRequest->getPassword(), PASSWORD_DEFAULT);

        $result = $this->usersModel->insert($data);